[Killed] ConditionalExpression
src/helpers/updateItemQuantity.ts:9:9
     itemId: string,
     newQuantity: number
 ): CartItem[] => {
-    if (newQuantity <= 0) {
+    if (true) {
         return removeItemFromCart(cart, itemId);
     }
killedBy: updateItemQuantity updates the quantity of an existing item
statusReason: expected [ { id: '2', name: 'Banana', …(2) } ] to have a length of 2 but got 1

[Killed] EqualityOperator
src/helpers/updateItemQuantity.ts:9:9
     itemId: string,
     newQuantity: number
 ): CartItem[] => {
-    if (newQuantity <= 0) {
+    if (newQuantity > 0) {
         return removeItemFromCart(cart, itemId);
     }
killedBy: updateItemQuantity updates the quantity of an existing item
statusReason: expected [ { id: '2', name: 'Banana', …(2) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/helpers/updateItemQuantity.ts:14:9
     }
 
     return cart.map(item =>
-        item.id === itemId
+        true
             ? { ...item, quantity: newQuantity }
             : item
killedBy: updateItemQuantity updates the quantity of an existing item
statusReason: expected { id: '2', name: 'Banana', …(2) } to be { id: '2', name: 'Banana', …(2) } // Object.is equality

[Killed] ConditionalExpression
src/helpers/updateItemQuantity.ts:14:9
     }
 
     return cart.map(item =>
-        item.id === itemId
+        false
             ? { ...item, quantity: newQuantity }
             : item
killedBy: updateItemQuantity updates the quantity of an existing item
statusReason: expected 2 to be 10 // Object.is equality
