[Killed] EqualityOperator
src/helpers/addItemToCart.ts:4:44
 import type {CartItem} from "../shared";
 
 export const addItemToCart = (cart: CartItem[], newItem: CartItem): CartItem[] => {
-    const existingItem = cart.find(item => item.id === newItem.id);
+    const existingItem = cart.find(item => item.id !== newItem.id);
 
     if (existingItem) {
killedBy: addItemToCart appends a new item when it does not exist
statusReason: expected [ { id: '1', name: 'Apple', …(2) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/helpers/addItemToCart.ts:4:44
 import type {CartItem} from "../shared";
 
 export const addItemToCart = (cart: CartItem[], newItem: CartItem): CartItem[] => {
-    const existingItem = cart.find(item => item.id === newItem.id);
+    const existingItem = cart.find(item => true);
 
     if (existingItem) {
killedBy: addItemToCart appends a new item when it does not exist
statusReason: expected [ { id: '1', name: 'Apple', …(2) } ] to have a length of 2 but got 1

[Killed] EqualityOperator
src/helpers/addItemToCart.ts:8:13
 
     if (existingItem) {
         return cart.map(item =>
-            item.id === newItem.id
+            item.id !== newItem.id
                 ? { ...item, quantity: item.quantity + newItem.quantity }
                 : item
killedBy: addItemToCart increments quantity when the item already exists
statusReason: expected 2 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/helpers/addItemToCart.ts:8:13
 
     if (existingItem) {
         return cart.map(item =>
-            item.id === newItem.id
+            true
                 ? { ...item, quantity: item.quantity + newItem.quantity }
                 : item
killedBy: addItemToCart increments quantity when the item already exists
statusReason: expected { id: '2', name: 'Banana', …(2) } to be { id: '2', name: 'Banana', …(2) } // Object.is equality

[Killed] ArithmeticOperator
src/helpers/addItemToCart.ts:9:40
     if (existingItem) {
         return cart.map(item =>
             item.id === newItem.id
-                ? { ...item, quantity: item.quantity + newItem.quantity }
+                ? { ...item, quantity: item.quantity - newItem.quantity }
                 : item
         );
killedBy: addItemToCart increments quantity when the item already exists
statusReason: expected -1 to be 5 // Object.is equality
