[Killed] EqualityOperator
src/helpers/applyDiscount.ts:3:9
 
 export const applyDiscount = (amount: number, discountPercent: number): number => {
-    if (discountPercent < 0) return amount;
+    if (discountPercent >= 0) return amount;
     if (discountPercent > 100) return 0;
 
killedBy: applyDiscount applies correct discount for positive percentage
statusReason: expected 100 to be 90 // Object.is equality

[Killed] ConditionalExpression
src/helpers/applyDiscount.ts:3:9
 
 export const applyDiscount = (amount: number, discountPercent: number): number => {
-    if (discountPercent < 0) return amount;
+    if (true) return amount;
     if (discountPercent > 100) return 0;
 
killedBy: applyDiscount applies correct discount for positive percentage
statusReason: expected 100 to be 90 // Object.is equality

[Killed] ConditionalExpression
src/helpers/applyDiscount.ts:4:9
 
 export const applyDiscount = (amount: number, discountPercent: number): number => {
     if (discountPercent < 0) return amount;
-    if (discountPercent > 100) return 0;
+    if (true) return 0;
 
     return amount * (1 - discountPercent / 100);
killedBy: applyDiscount returns original amount when discount is 0%
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/helpers/applyDiscount.ts:4:9
 
 export const applyDiscount = (amount: number, discountPercent: number): number => {
     if (discountPercent < 0) return amount;
-    if (discountPercent > 100) return 0;
+    if (false) return 0;
 
     return amount * (1 - discountPercent / 100);
killedBy: applyDiscount returns 0 when discount is greater than 100%
statusReason: expected -1.0000000000000009 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/helpers/applyDiscount.ts:6:22
     if (discountPercent < 0) return amount;
     if (discountPercent > 100) return 0;
 
-    return amount * (1 - discountPercent / 100);
+    return amount * (1 + discountPercent / 100);
 };
killedBy: applyDiscount applies correct discount for positive percentage
statusReason: expected 110.00000000000001 to be 90 // Object.is equality

[Killed] ArithmeticOperator
src/helpers/applyDiscount.ts:6:26
     if (discountPercent < 0) return amount;
     if (discountPercent > 100) return 0;
 
-    return amount * (1 - discountPercent / 100);
+    return amount * (1 - discountPercent * 100);
 };
killedBy: applyDiscount applies correct discount for positive percentage
statusReason: expected -99900 to be 90 // Object.is equality
