[Killed] ArithmeticOperator
src/helpers/calculateSubtotal.ts:4:41
 import type {CartItem} from "../shared";
 
 export const calculateSubtotal = (cart: CartItem[]): number => {
-    return cart.reduce((total, item) => total + item.price * item.quantity, 0);
+    return cart.reduce((total, item) => total - item.price * item.quantity, 0);
 };
killedBy: calculateSubtotal calculates subtotal correctly for integer prices and quantities
statusReason: expected -35 to be 35 // Object.is equality

[Killed] ArithmeticOperator
src/helpers/calculateSubtotal.ts:4:49
 import type {CartItem} from "../shared";
 
 export const calculateSubtotal = (cart: CartItem[]): number => {
-    return cart.reduce((total, item) => total + item.price * item.quantity, 0);
+    return cart.reduce((total, item) => total + item.price / item.quantity, 0);
 };
killedBy: calculateSubtotal calculates subtotal correctly for integer prices and quantities
statusReason: expected 6.666666666666667 to be 35 // Object.is equality
