[Killed] EqualityOperator
src/helpers/removeItemFromCart.ts:4:32
 import type {CartItem} from "../shared";
 
 export const removeItemFromCart = (cart: CartItem[], itemId: string): CartItem[] => {
-    return cart.filter(item => item.id !== itemId);
+    return cart.filter(item => item.id === itemId);
 };
killedBy: updateItemQuantity removes the item when newQuantity <= 0
statusReason: expected { id: '1', name: 'Apple', …(2) } to deeply equal { id: '2', name: 'Banana', …(2) }

[Killed] MethodExpression
src/helpers/removeItemFromCart.ts:4:12
 import type {CartItem} from "../shared";
 
 export const removeItemFromCart = (cart: CartItem[], itemId: string): CartItem[] => {
-    return cart.filter(item => item.id !== itemId);
+    return cart;
 };
killedBy: updateItemQuantity removes the item when newQuantity <= 0
statusReason: expected [ …(2) ] to have a length of 1 but got 2
